pokemon_app/app/controllers/pokemons_controller.rb

  def create
    @pokemon = Pokemon.new
    @pokemon.species = params[:species]
    @pokemon.nickname = params[:nickname]
    @pokemon.level = params[:level]
    @pokemon.image = params[:image]
    @pokemon.save
---
INSERT INTO "pokemons" ("species", "nickname", "level", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"